;班级：B19222
;姓名：赵雪坤
;功能介绍：
;利用单片机的定时器实现LED亮50ms的时间，然后熄灭。
;本次使用晶振为12M

ORG 	0000H
AJMP 	START
ORG		000BH
AJMP	TIME0_INT

;********初始化程序*********
START:
	MOV		TMOD,#01H	;使用定时器0方式1	16位定时器
	MOV 	TH0,#60		;因为要计时50ms，且晶振为12M，
						;所以定时器高8位为(65536-50000)/256取整数
					
	MOV		TL0,#176		;因为要计时50ms，且晶振为12M，
						;所以定时器低8位为(65536-50000)%256取整数
	MOV		IE,#82H		;打开总中断和定时器0的中断
	SETB 	TR0			;打开定时器0
	SJMP	$			;等待定时器0中断响应
;***************************

;*********定时器0中断*******
TIME0_INT:
	MOV 	TH0,#60		;再次装载一次
	MOV		TL0,#176	
	CPL	P1.0	;对LED引脚P1.0进行取反
	RETI		;中断返回指令
;***************************
END
